app/controllers/products_controller.rb

  def index
    if params[:q]
        search_term = params[:q]
        @products = Product.search(search_term)
---
SELECT "products".* FROM "products"

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "name" = $1, "image_url" = $2, "colour" = $3, "price" = $4, "updated_at" = $5 WHERE "products"."id" = $6  [["name", "Electric Bike"], ["image_url", ""], ["colour", "Black"], ["price", 2000], ["updated_at", "2018-01-11 08:07:08.176894"], ["id", 6]]

  def destroy
    @product.destroy
---
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 5]]

    def set_product
      @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]